/*=======================================================================
Content  : FormLoad
========================================================================*/
$(document).ready(function(){
	try{
		Gnb.PageLoad();
	}
	catch(e){ console.log(e.message); }
	
});


/*=======================================================================
Content  : FormBeforeUnLoad
========================================================================*/
function FormBeforeUnLoad() {
    try {
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
Gnb Class 명세 시작 (상수(변수)>>속성>>메서드)
========================================================================*/
//Gnb Class
var Gnb = {};

//Gnb Const

//Gnb Variable
Gnb.files = [];
Gnb.selectLedgerSeq = 0;
var multiRequest = "";
var checkExcelFlag = false;

//Gnb
var Properties = {};
Gnb.Properties = Properties;

//Gnb Method
Gnb.PageLoad = function () { };  //메인 페이지 로드 공통 함수
Gnb.SetEvent = function () { };  //메인 페이지 이벤트 바인딩
/*=======================================================================
Gnb Class 명세 끝
========================================================================*/

/*=======================================================================
내      용  : 메인 페이지 로드(PageLoad)
작  성  자  : 김진열
2022.08.18 - 최초생성
========================================================================*/
Gnb.PageLoad = function () {
    try {
        Gnb.Init();
        Gnb.SetEvent();
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
내      용  : 메인 페이지 초기화
작  성  자  : 김진열
2022.08.18 - 최초생성
========================================================================*/
Gnb.Init = function () {
    try {
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
내      용  : 이벤트 핸들러
작  성  자  : 김진열
2022.08.18 - 최초생성
========================================================================*/
Gnb.SetEvent = function () {
    try {
		$(".user-name").click(function() {
			$(".user-sub").fadeToggle(100);
		});
    }
    catch (e) { console.log(e.message); }
}