/*=======================================================================
Content  : FormLoad
========================================================================*/
$(document).ready(function(){
	try{
		Login.PageLoad();
	}
	catch(e){ console.log(e.message); }
	
});


/*=======================================================================
Content  : FormBeforeUnLoad
========================================================================*/
function FormBeforeUnLoad() {
    try {
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
Login Class 명세 시작 (상수(변수)>>속성>>메서드)
========================================================================*/
//Login Class
var Login = {};

//Login Const

//Login Variable

//Login
var Properties = {};
Login.Properties = Properties;

//Login Method
Login.PageLoad = function () { };  //메인 페이지 로드 공통 함수
Login.SetEvent = function () { };  //메인 페이지 이벤트 바인딩
/*=======================================================================
Login Class 명세 끝
========================================================================*/

/*=======================================================================
내      용  : 메인 페이지 로드(PageLoad)
작  성  자  : 김진열
2022.08.05 - 최초생성
========================================================================*/
Login.PageLoad = function () {
    try {
        Login.Init();
        Login.SetEvent();
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
내      용  : 메인 페이지 초기화
작  성  자  : 김진열
2022.08.05 - 최초생성
========================================================================*/
Login.Init = function () {
    try {
		if(Common.GetCookie("userId") != null) {
			$("#mId").val(Common.GetCookie("userId"));
			$("#mPw").focus();
			$("#idSave").prop("checked", true);
		}else {
			$("#mId").focus();
		}
    }
    catch (e) { console.log(e.message); }
}

/*=======================================================================
내      용  : 이벤트 핸들러
작  성  자  : 김진열
2022.08.05 - 최초생성
========================================================================*/
Login.SetEvent = function () {
    try {
    }
    catch (e) { console.log(e.message); }
}
